#pragma once

/// @file Magnetometer_LIS3MDL.cppm
/// @brief Magnetometer driver for the LIS3MDL.

#if __has_include(<config.h>)
    #include <config.h>
#endif

#include <algorithm>
#include <cmath>
#include <cstdint>
#include <limits>

#include <Result.h>
#include <SerialInterfaceDevice.h>
#include <Task.h>
#include <Vector.h>

namespace atmc
{
    namespace LIS3MDL
    {
        static_assert(__BYTE_ORDER__ == __ORDER_LITTLE_ENDIAN__, "This LIS3MDL driver requires a little-endian byte order.");

        // v Basic data definitions.

        constexpr int AddrLow = 0x1C;
        constexpr int AddrHigh = 0x1E;
        constexpr int DeviceID = 0x3D; // Result of reading register LIS3MDL_REGISTER_WHO_AM_I.

        // ^ Basic data definitions. / Register definitions. v

        /// @brief Register addresses.
        /// @note Static class.
        struct RegAddr
        {
            using RegisterAddress = int;
            constexpr static int Size = sizeof(uint8_t);
            constexpr static RegisterAddress OffsetXRegLM = 0x05;
            constexpr static RegisterAddress OffsetXRegHM = 0x06;
            constexpr static RegisterAddress OffsetYRegLM = 0x07;
            constexpr static RegisterAddress OffsetYRegHM = 0x08;
            constexpr static RegisterAddress OffsetZRegLM = 0x09;
            constexpr static RegisterAddress OffsetZRegHM = 0x0A;
            constexpr static RegisterAddress WhoAmI = 0x0F;
            constexpr static RegisterAddress CtrlReg1 = 0x20;
            constexpr static RegisterAddress CtrlReg2 = 0x21;
            constexpr static RegisterAddress CtrlReg3 = 0x22;
            constexpr static RegisterAddress CtrlReg4 = 0x23;
            constexpr static RegisterAddress CtrlReg5 = 0x24;
            constexpr static RegisterAddress StatusReg = 0x27;
            constexpr static RegisterAddress OutXL = 0x28;
            constexpr static RegisterAddress OutXH = 0x29;
            constexpr static RegisterAddress OutYL = 0x2A;
            constexpr static RegisterAddress OutYH = 0x2B;
            constexpr static RegisterAddress OutZL = 0x2C;
            constexpr static RegisterAddress OutZH = 0x2D;
            constexpr static RegisterAddress TempOutL = 0x2E;
            constexpr static RegisterAddress TempOutH = 0x2F;
            constexpr static RegisterAddress IntCfg = 0x30;
            constexpr static RegisterAddress IntSrc = 0x31;
            constexpr static RegisterAddress IntThsL = 0x32;
            constexpr static RegisterAddress IntThsH = 0x33;

            RegAddr() = delete;
        };

        // ^ Register definitions. / Magnetometer sensitivity constants. v

        constexpr float SensitivityForFS4G = 1.0f / 6842.0f;  // Sensitivity value for 4 gauss full scale.
        constexpr float SensitivityForFS8G = 1.0f / 3421.0f;  // Sensitivity value for 8 gauss full scale.
        constexpr float SensitivityForFS12G = 1.0f / 2281.0f; // Sensitivity value for 12 gauss full scale.
        constexpr float SensitivityForFS16G = 1.0f / 1711.0f; // Sensitivity value for 16 gauss full scale.

        // ^ Magnetometer sensitivity constants. / Default configuration settings. v

#if LIS3MDL_TIMEOUT
        constexpr int TimeoutDuration = LIS3MDL_TIMEOUT;
#else
        constexpr int TimeoutDuration = 10000;
#endif

        // ^ Default configuration settings.

#pragma pack(push, 1)

        /// @brief Operating mode settings.
        /// @see `RegisterCtrl1::operatingModeXY` and `RegisterCtrl4::operatingModeZ`.
        enum class OperatingMode : uint_least8_t
        {
            LowPower = 0b00,
            MediumPerformance = 0b01,
            HighPerformance = 0b10,
            UltraHighPerformance = 0b11
        };

        /// @brief Control register 1 settings.
        struct RegisterCtrl1
        {
            bool selfTest : 1 = false;
            bool fastDataRate : 1 = true;
            uint8_t outputDataRate : 3 = RegisterCtrl1::outputDataRateFreqToBits(80.0f);
            OperatingMode operatingModeXY : 2 = OperatingMode::UltraHighPerformance;
            bool tempEnabled : 1 = true;

            /// @brief Convert output data rate frequency to its bit representation.
            /// @param hz Output data rate frequency in Hz.
            /// @return Bit representation of the output data rate frequency.
            /// @note If the frequency is not supported, the function will default to taking 10 Hz.
            /// @see `RegisterCtrl1::outputDataRate`.
            constexpr static uint8_t outputDataRateFreqToBits(float hz)
            {
                if (hz == 0.625f)
                    return 0b000;
                else if (hz == 1.25f)
                    return 0b001;
                else if (hz == 2.5f)
                    return 0b010;
                else if (hz == 5.0f)
                    return 0b011;
                else if (hz == 20.0f)
                    return 0b101;
                else if (hz == 40.0f)
                    return 0b110;
                else if (hz == 80.0f)
                    return 0b111;
                else // if (hz == 10.0f)
                    return 0b100;
            }

            constexpr bool operator==(const RegisterCtrl1& other) const noexcept = default;
        };
        static_assert(sizeof(RegisterCtrl1) == 1, "Type `RegisterCtrl1` must be packed to one byte.");

        /// @brief Control register 2 settings.
        struct RegisterCtrl2
        {
            uint8_t _rsv3 : 2 = 0;
            bool softReset : 1 = false;
            bool reboot : 1 = false;
            uint8_t _rsv2 : 1 = 0;
            uint8_t fullScaleConfig : 2 = RegisterCtrl2::fullScaleConfigRangeToBits(16);
            uint8_t _rsv1 : 1 = 0;

            /// @brief Convert a magnetometer data range to its bit representation. The range of the magnetometer will be [ -rangeUpper, rangeUpper ] * 10^-1 mT.
            /// @param rangeUpper The upper limit of the range in Gauss (milliTesla).
            /// @return Bit representation of the magnetometer data range.
            /// @note If the range is not supported, the function will default to taking 4 Gauss.
            /// @see `RegisterCtrl2::fullScaleConfig`.
            constexpr static uint8_t fullScaleConfigRangeToBits(int rangeUpper)
            {
                switch (rangeUpper)
                {
                case 8: return 0b01;
                case 12: return 0b10;
                case 16: return 0b11;
                case 4:
                default: return 0b00;
                }
            }
            /// @brief Obtain the sensitivity multiplier for the magnetometer data range by its bit representation.
            /// @param fullScaleConfig The bit representation of the magnetometer data range.
            /// @return The sensitivity multiplier for the magnetometer data range.
            /// @note If the bit representation is not supported, the function will default to taking 4 Gauss.
            /// @see `RegisterCtrl2::fullScaleConfig`.
            constexpr static float fullScaleConfigToGaussPerLSB(uint8_t fullScaleConfig)
            {
                switch (fullScaleConfig)
                {
                case RegisterCtrl2::fullScaleConfigRangeToBits(8): return LIS3MDL::SensitivityForFS8G;
                case RegisterCtrl2::fullScaleConfigRangeToBits(12): return LIS3MDL::SensitivityForFS12G;
                case RegisterCtrl2::fullScaleConfigRangeToBits(16): return LIS3MDL::SensitivityForFS16G;
                case RegisterCtrl2::fullScaleConfigRangeToBits(4):
                default: return LIS3MDL::SensitivityForFS4G;
                }
            }

            constexpr bool operator==(const RegisterCtrl2& other) const noexcept = default;
        };
        static_assert(sizeof(RegisterCtrl1) == 1, "Type `RegisterCtrl2` must be packed to one byte.");

        /// @brief SPI interface type settings.
        /// @see `RegisterCtrl3::spiInterface`.
        enum class SPIInterfaceType : uint_least8_t
        {
            FourWire = 0,
            ThreeWire = 1
        };
        /// @brief System operating mode settings.
        /// @see `RegisterCtrl3::systemOperatingMode`.
        enum class SystemOperatingMode : uint_least8_t
        {
            ContinuousConversion = 0b00,
            SingleConversion = 0b01,
            PowerDown = 0b11
        };

        /// @brief Control register 3 settings.
        struct RegisterCtrl3
        {
            SystemOperatingMode systemOperatingMode : 2 = SystemOperatingMode::ContinuousConversion;
            SPIInterfaceType spiInterface : 1 = SPIInterfaceType::FourWire;
            uint8_t _rsv2 : 2 = 0;
            bool lowPower : 1 = false;
            uint8_t _rsv1 : 2 = 0;

            constexpr bool operator==(const RegisterCtrl3& other) const noexcept = default;
        };
        static_assert(sizeof(RegisterCtrl3) == 1, "Type `RegisterCtrl3` must be packed to one byte.");

        /// @brief Endianness settings.
        /// @warning Do not touch `RegisterCtrl4::_rsvEndianness`. This driver will always assume the lower address is the least significant byte.
        /// @see `RegisterCtrl4::_rsvEndianness`.
        enum class Endianness : uint_least8_t
        {
            LowerAddressLSB = 0,
            LowerAddressMSB = 1
        };

        /// @brief Control register 4 settings.
        struct RegisterCtrl4
        {
            uint8_t _rsv2 : 1 = 0;
            Endianness _rsvEndianness : 1 = Endianness::LowerAddressLSB; // Don't touch this one.
            OperatingMode operatingModeZ : 2 = OperatingMode::UltraHighPerformance;
            uint8_t _rsv1 : 4 = 0;

            constexpr bool operator==(const RegisterCtrl4& other) const noexcept = default;
        };
        static_assert(sizeof(RegisterCtrl4) == 1, "Type `RegisterCtrl4` must be packed to one byte.");

        /// @brief Block data update settings.
        /// @see `RegisterCtrl5::blockDataUpdate`.
        enum class BlockDataUpdate : uint_least8_t
        {
            Continuous = 0,
            UntilRead = 1
        };

        /// @brief Control register 5 settings.
        struct RegisterCtrl5
        {
            uint8_t _rsv : 6 = 0;
            BlockDataUpdate blockDataUpdate : 1 = BlockDataUpdate::UntilRead;
            bool fastRead : 1 = false;

            constexpr bool operator==(const RegisterCtrl5& other) const noexcept = default;
        };
        static_assert(sizeof(RegisterCtrl5) == 1, "Type `RegisterCtrl5` must be packed to one byte.");

        /// @brief Status register settings.
        struct RegisterStatus
        {
            bool xNewDataAvail : 1 = false;
            bool yNewDataAvail : 1 = false;
            bool zNewDataAvail : 1 = false;
            bool xyzNewDataAvail : 1 = false;
            bool xOverrun : 1 = false;
            bool yOverrun : 1 = false;
            bool zOverrun : 1 = false;
            bool xyzOverrun : 1 = false;

            constexpr bool operator==(const RegisterStatus& other) const noexcept = default;
        };
        static_assert(sizeof(RegisterStatus) == 1, "Type `RegisterStatus` must be packed to one byte.");

        enum class PolarityIRQ : uint_least8_t
        {
            ActiveLow = 0,
            ActiveHigh = 1
        };
        /// @brief Latch interrupt request settings.
        /// @see `RegisterInterruptConfig::latchIRQ`.
        enum class LatchIRQMode : uint_least8_t
        {
            Latched = 0,
            NotLatched = 1
        };

        /// @brief Interrupt configuration register settings.
        struct RegisterIRQConfig
        {
            bool intPinInterrupt : 1 = false;
            LatchIRQMode latchIRQ : 1 = LatchIRQMode::Latched;
            PolarityIRQ iea : 1 = PolarityIRQ::ActiveLow;
            uint8_t _rsv2 : 1 = 1;
            uint8_t _rsv1 : 1 = 0;
            bool zIRQ : 1 = true;
            bool yIRQ : 1 = true;
            bool xIRQ : 1 = true;

            constexpr bool operator==(const RegisterIRQConfig& other) const noexcept = default;
        };
        static_assert(sizeof(RegisterIRQConfig) == 1, "Type `RegisterIRQConfig` must be packed to one byte.");

        /// @brief Interrupt source register settings.
        struct RegisterIRQSrc
        {
            bool interruptOccurred : 1; // Indeterminate unless obtained.
            bool measRangeMagValOverflow : 1 = false;
            bool zExceedsNveThreshold : 1 = false;
            bool yExceedsNveThreshold : 1 = false;
            bool xExceedsNveThreshold : 1 = false;
            bool zExceedsPveThreshold : 1 = false;
            bool yExceedsPveThreshold : 1 = false;
            bool xExceedsPveThreshold : 1 = false;
        };
        static_assert(sizeof(RegisterIRQSrc) == 1, "Type `RegisterIRQSrc` must be packed to one byte.");

        template <typename T>
        concept ConfigRegisterType = std::same_as<T, RegisterCtrl1> || std::same_as<T, RegisterCtrl2> || std::same_as<T, RegisterCtrl3> || std::same_as<T, RegisterCtrl4> ||
            std::same_as<T, RegisterCtrl5> || std::same_as<T, RegisterIRQConfig>;

        template <typename T>
        concept DataRegisterType = std::same_as<T, RegisterStatus> || std::same_as<T, RegisterIRQSrc>;

        template <typename T>
        requires ConfigRegisterType<T> || DataRegisterType<T>
        constexpr uint16_t registerAddressOf()
        {
            if constexpr (std::same_as<T, RegisterCtrl1>)
                return LIS3MDL::RegAddr::CtrlReg1;
            else if constexpr (std::same_as<T, RegisterCtrl2>)
                return LIS3MDL::RegAddr::CtrlReg2;
            else if constexpr (std::same_as<T, RegisterCtrl3>)
                return LIS3MDL::RegAddr::CtrlReg3;
